<?php
	// var_dump($_GET);
	// 返回用户评价信息的文件

	// 评价的类型
	$tabType = $_GET['tabType'];		// good bad soso
	
	// 定义包含所有评价信息的数组
	$arrInfo = [
		'good' =>[
			0 => '这件衣服穿衣来跟没有穿一样，好评--0',
			1 => '这件衣服穿衣来跟没有穿一样，好评--1',
			2 => '这件衣服穿衣来跟没有穿一样，好评--2',
			3 => '这件衣服穿衣来跟没有穿一样，好评--3',
			4 => '这件衣服穿衣来跟没有穿一样，好评--4',
			5 => '这件衣服穿衣来跟没有穿一样，好评--5',
			6 => '这件衣服穿衣来跟没有穿一样，好评--6'
		],
		'soso' =>[
			0 => '这件衣服穿衣来跟没有穿一样，中评--0',
			1 => '这件衣服穿衣来跟没有穿一样，中评--1',
			2 => '这件衣服穿衣来跟没有穿一样，中评--2',
			3 => '这件衣服穿衣来跟没有穿一样，中评--3',
			4 => '这件衣服穿衣来跟没有穿一样，中评--4',
			5 => '这件衣服穿衣来跟没有穿一样，中评--5',
			6 => '这件衣服穿衣来跟没有穿一样，中评--6'
		],
		'bad' =>[
			0 => '这件衣服穿衣来跟没有穿一样，差评--0',
			1 => '这件衣服穿衣来跟没有穿一样，差评--1',
			2 => '这件衣服穿衣来跟没有穿一样，差评--2',
			3 => '这件衣服穿衣来跟没有穿一样，差评--3',
			4 => '这件衣服穿衣来跟没有穿一样，差评--4',
			5 => '这件衣服穿衣来跟没有穿一样，差评--5',
			6 => '这件衣服穿衣来跟没有穿一样，差评--6'
		]
	];

	// 定义包含评价 -- 定义包含好评信息的数组
	// $arrInfo = ;

	// var_dump($arrInfo);
	// echo $arrInfo;

	/*
		PHP在传递数据时只能传递字符串，不能直接传递数组
	*/ 

	/*
		["\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--0","\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--1","\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--2","\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--3","\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--4","\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--5","\u8fd9\u4ef6\u8863\u670d\u7a7f\u8863\u6765\u8ddf\u6ca1\u6709\u7a7f\u4e00\u6837\uff0c\u597d\u8bc4--6"]
	*/

	// 将数组转为JSON字符串
	echo json_encode($arrInfo[$tabType]);
?>